import { useState, useRef, useEffect } from 'react';

    export default function Accordion({ items }) {
    const [openIndex, setOpenIndex] = useState(-1);
    const contentRefs = useRef([]);

    useEffect(() => {
    const timeout = setTimeout(() => {
        contentRefs.current.forEach((ref, index) => {
        if (ref) {
            if (openIndex === index) {
                ref.style.maxHeight = ref.scrollHeight + 'px';
            } else {
                ref.style.maxHeight = '0px';
            }
        }
        });
    }, 10); // small delay helps ensure DOM is ready

    return () => clearTimeout(timeout);
    }, [openIndex]);



    const accordionContent = {
        experience: (
            <ul>
                <li className="text-left">Εταιρία Περιφερειακής Ανάπτυξης και Ψυχικής Υγείας (Ε.Π.Α.Ψ.Υ.) Στο Πολυδύναμο Κέντρο Ημέρας Αμαρουσίου “Franco Basaglia”, είναι υπεύθυνη της υπηρεσίας Οικογενειακής Θεραπείας, παρέχοντας ατομική ψυχοθεραπεία, οικογενειακή θεραπεία, καθώς και θεραπεία ζεύγους, κατόπιν αιτήματος είτε των ίδιων των ενδιαφερόμενων είτε από την Εισαγγελία ανηλίκων Αθηνών, κατόπιν σχετικής Εντολής. Παράλληλα παρέχει συνεδρίες ψυχοθεραπείας σε ανθρώπους με σοβαρές ψυχιατρικές διαταραχές και συντονίζει ομάδες πολυοικογενειακής θεραπείας ασθενών και των συγγενών τους. Επιπλέον, κατά τη διάρκεια της πανδημίας Covid-19, συντόνισε ομάδες ψυχολογικής υποστήριξης και ενδυνάμωσης για το υγειονομικό προσωπικό νοσοκομείων στα Βόρεια Προάστια Αττικής</li>
                <li className="text-left">Τμήμα Υιοθεσιών του Οργανισμού "Το Χαμόγελο του Παιδιού" Εργάστηκε παρέχοντας συνεδρίες ψυχοθεραπείας και συμβουλευτικής σε υποψήφιους θετούς/ ανάδοχους γονείς και διεξήγαγε σεμινάρια ενδυνάμωσης στο γονεϊκού τους ρόλο.</li>
                <li className="text-left">Σπίτι Παιδικής Προστασίας του Οργανισμού "Το Χαμόγελο του Παιδιού" Παρείχε ατομικές και ομαδικές συνεδρίες ψυχολογικής υποστήριξης στο προσωπικό των Σπιτιών Παιδικής Προστασίας, βοηθώντας τους στην αποφόρτιση από τις δυσκολίες της δουλειάς τους.</li>
                <li className="text-left">Εθνική Τηλεφωνική Γραμμή για τα Παιδιά 1056 και Ευρωπαϊκή Γραμμή 116000 Παρείχε ψυχολογική υποστήριξη σε γονείς και παιδιά, καθώς και ψυχολογική υποστήριξη σε περιστατικά εκούσιων φυγών ή αγνοούμενων παιδιών, καθώς και σε περιπτώσεις κακοποίησης και παραμέλησης.</li>
                <li className="text-left">Ψυχοπαιδαγωγικό Κέντρο «ΠΝΟΗ» του Φορέα «ΕΔΡΑ» Παρείχε συνεδρίες συμβουλευτικής γονέων και,, παράλληλα, εργάστηκε εθελοντικά στην Γραμμή "Μαζί για το Παιδί" για την ψυχολογική υποστήριξη γονέων.</li>
            </ul>
        ),
        training: (
            <ul>
                <li><p className="text-left">Πρώιμη Παρέμβαση στη βρεφική και νηπιακή ηλικίαΕκπαιδευτικό πρόγραμμα (Νοέμβριος 2018-Ιούνιος 2019) από το Κέντρο Κοινοτικής Ψυχικής Υγιεινής του Ε.Κ.Π.Α.</p></li>
                <li><p className="text-left">Θέματα Ψυχικής Υγείας Παιδιών και ΕφήβωνΕκπαιδευτικό πρόγραμμα από το Κοινοτικό Κέντρο Ψυχικής Υγείας Παγκρατίου (Οκτώβριος 2019-Μάιος 2020).</p></li>
                <li><p className="text-left">Σύγχρονα Θέματα Ειδικής Αγωγής: Μαθησιακές Δυσκολίες – ΔυσλεξίαΕξειδικευμένο σεμινάριο 450 ωρών από το Ε.Κ.Π.Α. (Σεπτέμβριος 2010-Ιούνιος 2011).</p></li>
            </ul>
        ),
        conferences: (
            <ul>
                <li><p className="text-left">Καραβάνα, Ε., Αντωνίου, Σ. & Ντάλλα, Μ. (2011, Μάιος).Επαγγελματική εξουθένωση, εργασιακό στρες και τρόποι αντιμετώπισής τους σε Έλληνες εκπαιδευτικούς γενικής και ειδικής αγωγής.Ανακοίνωση στο 13ο Πανελλήνιο συνέδριο Ψυχολογικής Έρευνας, Αθήνα.</p></li>
                <li><p className="text-left">Καραβάνα, Ε. & Αντωνίου, Σ. (2011, Ιούνιος).Εργασιακό στρες, επαγγελματική εξουθένωση και προαγωγή υγείας εκπαιδευτικών γενικής και ειδικής αγωγής.Ανακοίνωση στο 3ο Πανελλήνιο συνέδριο Επιστημών Εκπαίδευσης, Τομέας Ειδικής Παιδαγωγικής και Ψυχολογίας & Κέντρο Μελέτης Ψυχοφυσιολογίας και Εκπαίδευσης του Παιδαγωγικού Τμήματος Δημοτικής Εκπαίδευσης, Εθνικό και Καποδιστριακό Πανεπιστήμιο Αθηνών, Αθήνα.</p></li>
                <li><p className="text-left">Καραβάνα, Ε. & Ντάλλα, Μ. (2011, Ιούνιος).Αντιλήψεις Νέων και Ενηλίκων για τον Έρωτα και το Γάμο.Ανακοίνωση στο 3ο Πανελλήνιο συνέδριο Επιστημών Εκπαίδευσης, Τομέας Ειδικής Παιδαγωγικής και Ψυχολογίας & Κέντρο Μελέτης Ψυχοφυσιολογίας και Εκπαίδευσης του Παιδαγωγικού Τμήματος Δημοτικής Εκπαίδευσης, Εθνικό και Καποδιστριακό Πανεπιστήμιο Αθηνών, Αθήνα.</p></li>
                <li><p className="text-left">Καραβάνα, Ε. & Γαλανάκη, Ε. (2014, Ιούνιος).Η σχέση της μοναξιάς με την προσαρμογή του παιδιού.Ανακοίνωση στο 4ο Πανελλήνιο συνέδριο Επιστημών Εκπαίδευσης, Τομέας Ειδικής Παιδαγωγικής και Ψυχολογίας & Κέντρο Μελέτης Ψυχοφυσιολογίας και Εκπαίδευσης του Παιδαγωγικού Τμήματος Δημοτικής Εκπαίδευσης, Εθνικό και Καποδιστριακό Πανεπιστήμιο Αθηνών, Αθήνα.</p></li>
                <li><p className="text-left">Καραβάνα, Ε. (2021, Μάϊος).Ψυχολογική υποστήριξη στην πανδημία. Το μοντέλο της δράσης Ψ-Υποστηρίζω Ε.Π.Α.Ψ.Υ. στους υγειονομικούς.Ανακοίνωση στο συνέδριο του Εθνικού Κέντρου Ψυχικής Υγείας.</p></li>
            </ul>
        ),
        perspective: (
            <>
                <p className="text-left">Η επαφή με τον άνθρωπο και την εσωτερική του διαδρομή ήταν για μένα από νωρίς κάτι βαθιά υπαρξιακό. Στην ψυχοθεραπεία ανακάλυψα έναν χώρο όπου η αλήθεια, ακόμα κι όταν είναι δύσκολη, μπορεί να έχει φωνή κι όπου η σχέση γίνεται το στήριγμα για να ειπωθούν, να βιωθούν και να μετακινηθούν όσα μοιάζουν αμετακίνητα.</p>
                <p className="text-left">Ως ψυχοθεραπευτής, προσεγγίζω τη θεραπεία με σεβασμό στη μοναδικότητα κάθε ανθρώπου. Εστιάζω στη σχέση που χτίζεται στο «εδώ και τώρα» και δουλεύω μέσα από μια συστημική - διαλεκτική οπτική, όπου ο άνθρωπος δεν νοείται μόνο ως άτομο, αλλά ως μέλος ενός ευρύτερου πλαισίου — οικογενειακού, κοινωνικού, πολιτισμικού.</p>
                <p className="text-left">Πιστεύω στη δύναμη της αυθεντικής συνάντησης, της ματιάς που βλέπει τον άνθρωπο χωρίς ερμηνείες, και της θεραπευτικής διαδικασίας που, αν και πολλές φορές απαιτητική, μπορεί να γίνει μια εμπειρία ανακούφισης, νοήματος και μεταμόρφωσης.</p>
            </>
        ),
    };


  return (
    <div className="space-y-4 max-w-6xl mx-auto p-4">
      {items.map((item, index) => {
        const isOpen = openIndex === index;

        return (
          <div
            key={index}
            className={`accordion-item [box-shadow:0_2px_10px_-3px_rgba(6,81,237,0.3)] border-2 ${
                isOpen ? 'border-primary-600' : 'border-transparent'
            } hover:border-secondary-600 rounded-lg transition-all`}

          >
            <button
              onClick={() => setOpenIndex(isOpen ? -1 : index)}
              className="w-full text-base font-medium text-left p-5 text-slate-900 flex items-center"
            >
              <span className="mr-4">{item.title}</span>
              <svg
                xmlns="http://www.w3.org/2000/svg"
                className={`w-[14px] h-[14px] ml-auto transition-transform duration-300 ${
                  isOpen ? 'rotate-180' : ''
                }`}
                viewBox="0 0 24 24"
              >
                <path
                  d="M11.99997 18.1669a2.38 2.38 0 0 1-1.68266-.69733l-9.52-9.52a2.38 2.38 0 1 1 3.36532-3.36532l7.83734 7.83734 7.83734-7.83734a2.38 2.38 0 1 1 3.36532 3.36532l-9.52 9.52a2.38 2.38 0 0 1-1.68266.69734z"
                />
              </svg>
            </button>
            <div
              ref={(el) => (contentRefs.current[index] = el)}
              className="overflow-hidden transition-[max-height] duration-500 ease-in-out"
            >
              <div className="pb-5 px-5 text-sm text-slate-600 leading-relaxed">{accordionContent[item.id]}</div>
            </div>
          </div>
        );
      })}
    </div>
  );
}
