import { useState, useRef, useEffect } from 'react';

    export default function Accordion({ items }) {
    const [openIndex, setOpenIndex] = useState(-1);
    const contentRefs = useRef([]);

    useEffect(() => {
    const timeout = setTimeout(() => {
        contentRefs.current.forEach((ref, index) => {
        if (ref) {
            if (openIndex === index) {
                ref.style.maxHeight = ref.scrollHeight + 'px';
            } else {
                ref.style.maxHeight = '0px';
            }
        }
        });
    }, 10); // small delay helps ensure DOM is ready

    return () => clearTimeout(timeout);
    }, [openIndex]);

    const accordionContent = {
        experience: (
            <ul>
                <li className="text-left">Εταιρία Περιφερειακής Ανάπτυξης και Ψυχικής Υγείας (Ε.Π.Α.Ψ.Υ.) Στο Πολυδύναμο Κέντρο Ημέρας Αμαρουσίου "Franco Basaglia", μέλος της υπηρεσίας Οικογενειακής Θεραπείας, παρέχοντας ατομική ψυχοθεραπεία, οικογενειακή θεραπεία, καθώς και θεραπεία ζεύγους, κατόπιν αιτήματος είτε των ίδιων των ενδιαφερόμενων είτε από την Εισαγγελία ανηλίκων Αθηνών, κατόπιν σχετικής Εντολής.H Παράλληλα παρέχει συνεδρίες ψυχοθεραπείας σε ανθρώπους με σοβαρές ψυχιατρικές διαταραχές και συντονίζει ομάδες πολυοικογενειακής θεραπείας ασθενών και των συγγενών τους. Επιπλέον, είναι μέλος της ομάδας κατ’ όικον παρέμβασης με αρμοδιότητες την παροχή υπηρεσιών ψυχικής υγείας σε κατοίκους του 5ου Τομέα Ψυχικής Υγείας.</li>
                <li className="text-left">ΚΜΟΠ - Κέντρο Κοινωνικής Δράσης και Καινοτομίας, στο πλαίσιο του προγράμματος «Social Net», όπου παρείχε συμβουλευτική και ψυχοκοινωνική υποστήριξη σε άτομα και ομάδες. Συντονισμός και παρουσιάσεις webinar για τις ψυχολογικές επιπτώσεις της πανδημίας COVID-19. Βιωματικές δράσεις σε σχολεία με θέμα τον σχολικό εκφοβισμό.</li>
                <li className="text-left">Solidarity Now, συμμετέχοντας σε προγράμματα όπως το ESTIA και το SIL - Step by Step. Οι βασικές αρμοδιότητές του περιλάμβαναν τη διαχείριση διαμονής των ωφελούμενων, την παρακολούθηση της νομικής τους κατάστασης, τη διενέργεια ατομικών και ομαδικών συνεδριών ψυχοκοινωνικής υποστήριξης, καθώς και τον συντονισμό υπηρεσιών υγείας και πρόνοιας. Παράλληλα, ανέλαβε τη διαχείριση κρίσεων, τη διασύνδεση των ωφελούμενων με την κοινότητα και τη διοργάνωση δράσεων κοινωνικής ένταξης, όπως πολιτιστικές επισκέψεις και εκπαιδευτικές δραστηριότητες.</li>
                <li className="text-left">Praksis Εργάστηκε στο πλαίσιο του προγράμματος «Στέγαση και Υπηρεσίες για Πρόσφυγες και Αιτούντες Άσυλο». Το έργο του περιλάμβανε την εγκατάσταση και την παρακολούθηση διαμονής των ωφελούμενων, τη διευκόλυνση της πρόσβασης σε ιατρικές και κοινωνικές υπηρεσίες, καθώς και τη συστηματική ψυχοκοινωνική υποστήριξη μέσω συνεδριών. Ιδιαίτερη έμφαση δόθηκε στη διαχείριση καταστάσεων κρίσης και στη διατήρηση σταθερής επικοινωνίας με τις αρμόδιες αρχές για την επίλυση νομικών ή διοικητικών ζητημάτων.</li>
                <li className="text-left">Διεθνής Οργανισμός Μετανάστευσης (IOM) πρόγραμμα «Έκτακτης Ανάγκης για Ασυνόδευτους Ανηλίκους», Κατά την εργασία του στον ΔΟΜ, εστίασε στην υποστήριξη ασυνόδευτων ανηλίκων στο πλαίσιο του προγράμματος έκτακτης ανάγκης. Οι αρμοδιότητές του ήταν αντίστοιχες με αυτές των άλλων οργανισμών, με επιπλέον έμφαση στη συνεργασία με κρατικούς φορείς (όπως το ΕΚΚΑ και η Υπηρεσία Ασύλου), στην ενίσχυση της προστασίας ευάλωτων παιδιών και στην ένταξή τους στο κοινωνικό πλαίσιο. Η διαχείριση νομικών υποθέσεων, η ψυχοκοινωνική ενδυνάμωση και η διασύνδεση με τοπικές δομές αποτελούσαν σταθερά σημεία του ρόλου της.</li>
            </ul>
        ),
        training: (
            <ul>
                <li><p className="text-left">Πρώιμη Παρέμβαση στη βρεφική και νηπιακή ηλικίαΕκπαιδευτικό πρόγραμμα (Νοέμβριος 2018-Ιούνιος 2019) από το Κέντρο Κοινοτικής Ψυχικής Υγιεινής του Ε.Κ.Π.Α.</p></li>
                <li><p className="text-left">Θέματα Ψυχικής Υγείας Παιδιών και ΕφήβωνΕκπαιδευτικό πρόγραμμα από το Κοινοτικό Κέντρο Ψυχικής Υγείας Παγκρατίου (Οκτώβριος 2019-Μάιος 2020).</p></li>
                <li><p className="text-left">Σύγχρονα Θέματα Ειδικής Αγωγής: Μαθησιακές Δυσκολίες – ΔυσλεξίαΕξειδικευμένο σεμινάριο 450 ωρών από το Ε.Κ.Π.Α. (Σεπτέμβριος 2010-Ιούνιος 2011).</p></li>
            </ul>
        ),
        conferences: (
            <ul>
                <li><p className="text-left"><b>Κωστικίδης Χ. & Πασχάλη Μ. (Απρίλιος 2015)</b>Επιστημονικό εργαστήριο με θέμα «Η φτώχεια και η στέρηση στην Ελλάδα. Ο κοινωνικός αντίκτυπος της κρίσης», το οποίο διοργανώθηκε στην Κομοτηνή από τη Διεύθυνση Δευτεροβάθμιας Εκπαίδευσης Ροδόπης, μέσω της Δομής Συμβουλευτικής Νέων, σε συνεργασία με το Τμήμα Κοινωνικής Διοίκησης και Πολιτικής Επιστήμης του Δημοκρίτειου Πανεπιστημίου Θράκης.</p></li>
                <li><p className="text-left"><b>Κωστικίδης Χ. (Νοέμβριος 2024)</b>Συνέδριο Κοινωνική Εργασία στην εποχή των «ρευστών βεβαιοτήτων»: Συνδέοντας την εμπειρία από το πεδίο με έρευνα. Τίτλος παρουσίασης: Από την ακούσια νοσηλεία στην κοινοτική ψυχιατρική φροντίδα: Προβλήματα και προοπτικές.</p></li>
                <li><p className="text-left">Καραβάνα, Ε. & Ντάλλα, Μ. (2011, Ιούνιος).Αντιλήψεις Νέων και Ενηλίκων για τον Έρωτα και το Γάμο.Ανακοίνωση στο 3ο Πανελλήνιο συνέδριο Επιστημών Εκπαίδευσης, Τομέας Ειδικής Παιδαγωγικής και Ψυχολογίας & Κέντρο Μελέτης Ψυχοφυσιολογίας και Εκπαίδευσης του Παιδαγωγικού Τμήματος Δημοτικής Εκπαίδευσης, Εθνικό και Καποδιστριακό Πανεπιστήμιο Αθηνών, Αθήνα.</p></li>
                <li><p className="text-left">Καραβάνα, Ε. & Γαλανάκη, Ε. (2014, Ιούνιος).Η σχέση της μοναξιάς με την προσαρμογή του παιδιού.Ανακοίνωση στο 4ο Πανελλήνιο συνέδριο Επιστημών Εκπαίδευσης, Τομέας Ειδικής Παιδαγωγικής και Ψυχολογίας & Κέντρο Μελέτης Ψυχοφυσιολογίας και Εκπαίδευσης του Παιδαγωγικού Τμήματος Δημοτικής Εκπαίδευσης, Εθνικό και Καποδιστριακό Πανεπιστήμιο Αθηνών, Αθήνα.</p></li>
                <li><p className="text-left">Καραβάνα, Ε. (2021, Μάϊος).Ψυχολογική υποστήριξη στην πανδημία. Το μοντέλο της δράσης Ψ-Υποστηρίζω Ε.Π.Α.Ψ.Υ. στους υγειονομικούς.Ανακοίνωση στο συνέδριο του Εθνικού Κέντρου Ψυχικής Υγείας.</p></li>
            </ul>
        ),
        perspective: (
            <>
                <p className="text-left">Η θεραπευτική μου προσέγγιση διαμορφώνεται μέσα από το βίωμα του διαλόγου, της σχέσης και της κοινωνικής σύνδεσης.</p>
                <p className="text-left">Ως κοινωνικός λειτουργός και συστημικός θεραπευτής, βλέπω τον άνθρωπο ως μέρος ενός σύνθετου κοινωνικού και οικογενειακού ιστού, όπου κάθε φωνή έχει σημασία.</p>
                <p className="text-left">Η ψυχοθεραπεία για μένα είναι ένας ζωντανός χώρος συνεύρεσης, στον οποίο ο άλλος μπορεί να ακουστεί και να επαναδιαπραγματευτεί την ιστορία του με νέους τρόπους. Στοχεύω στη δημιουργία ενός πλαισίου ασφάλειας και αμοιβαίου σεβασμού, όπου η αλλαγή γίνεται μέσα από τη σχέση και τη συνδημιουργία νοήματος.</p>
            </>
        ),
    };


  return (
    <div className="space-y-4 max-w-6xl mx-auto p-4">
      {items.map((item, index) => {
        const isOpen = openIndex === index;

        return (
          <div
            key={index}
            className={`accordion-item [box-shadow:0_2px_10px_-3px_rgba(6,81,237,0.3)] border-2 ${
                isOpen ? 'border-primary-600' : 'border-transparent'
            } hover:border-secondary-600 rounded-lg transition-all`}

          >
            <button
              onClick={() => setOpenIndex(isOpen ? -1 : index)}
              className="w-full text-base font-medium text-left p-5 text-slate-900 flex items-center"
            >
              <span className="mr-4">{item.title}</span>
              <svg
                xmlns="http://www.w3.org/2000/svg"
                className={`w-[14px] h-[14px] ml-auto transition-transform duration-300 ${
                  isOpen ? 'rotate-180' : ''
                }`}
                viewBox="0 0 24 24"
              >
                <path
                  d="M11.99997 18.1669a2.38 2.38 0 0 1-1.68266-.69733l-9.52-9.52a2.38 2.38 0 1 1 3.36532-3.36532l7.83734 7.83734 7.83734-7.83734a2.38 2.38 0 1 1 3.36532 3.36532l-9.52 9.52a2.38 2.38 0 0 1-1.68266.69734z"
                />
              </svg>
            </button>
            <div
              ref={(el) => (contentRefs.current[index] = el)}
              className="overflow-hidden transition-[max-height] duration-500 ease-in-out"
            >
              <div className="pb-5 px-5 text-sm text-slate-600 leading-relaxed">{accordionContent[item.id]}</div>
            </div>
          </div>
        );
      })}
    </div>
  );
}
